{
  "sectors": {
    "Technology": {
      "Semiconductors": [
        {
          "id": 1,
          "title": "Stock market today: Dow, S\u0026P 500, Nasdaq climb as Wall Street gets set to wrap up volatile week",
          "body": "US stock futures climbed on Friday, led again by tech as Wall Street looked for back-to-back gains to end a volatile week of solid bank earnings and geopolitical jitters.   Nasdaq 100 futures (NQ=F) rose roughly 0.4%, while those on the S\u0026P 500 (ES=F) added 0.2%. Contracts on the Dow Jones Industrial Average (YM=F), which includes fewer tech names, hovered around the flatline after stocks reversed a two-day losing streak on Thursday.   CBOT - Delayed Quote • USD     (YM=F)           Follow           View Quote Details      49,649.00  \u002B10.00  (\u002B0.02%)   As of 9:01:27 AM EST. Market Open.        YM=F ES=F NQ=F    Advanced Chart        Markets are poised for another winning day as TSMC (TSM) and Nvidia (NVDA) eye more gains, thanks in part to a US-Taiwan trade deal that promises a $250 billion boost to American chip and tech manufacturing. On Thursday, shares in TSMC popped following a strong quarterly report that revived AI enthusiasm to buoy related stocks more widely.          The highlights on Friday\u0027s earnings docket are smaller banks such as PNC (PNC) and Regions Financial (RF), after a big week of upbeat reports from Wall Street majors. Goldman Sachs (GS) and Morgan Stanley (MS) shares rose Thursday after posting profit gains, giving a lift to financial stocks.   Wall Street is regrouping after a switchback week, marked by escalating Iran tensions, dispute over Greenland, and criminal probe risking the Federal Reserve’s independence — all with President Trump behind them. Investors have a long weekend to digest those events, as stock and bond markets are closed on Monday for Martin Luther King Jr. Day.   Oil prices climbed, retracing some of the losses suffered recently amid fears of a US military strike on Iran. Brent crude futures (BZ=F) traded above $64 a barrel, while West Texas Intermediate (CL=F) futures neared $60, both set to end a bumpy week with small gains.          Meanwhile, silver (SI=F) fell as the threat of US tariffs eased, but prices were still up more than 15% for the week after a long-lived blistering rally for precious metals.   Despite Thursday’s rally, major indexes are on track to finish the week lower amid Wall Street\u0027s first stretch of volatility in the new year. The S\u0026P 500 (^GSPC) is down about 0.3% for the week, the Nasdaq Composite (^IXIC) is off roughly 0.6%, and the Dow (^DJI) is fractionally lower.   LIVE 12 updates            26 mins ago Grace O\u0027Donnell  State Street expands revenue, but earnings miss, sending the stock lower   A day after launching its institutional digital asset platform to push further into crypto, asset manager and custody bank State Street (STT) reported fourth quarter results that showed solid underlying trends. But a repositioning charge weighed on earnings — and shares in premarket trading. State Street\u0027s stock fell more than 2% ahead of the opening bell on Friday.  The asset manager reported rising revenue of $3.7 billion in the fourth quarter, driven by increased fee revenue and topping Wall Street analyst expectations for $3.6 billion in revenue, according to S\u0026P Global Market Intelligence data. Net interest income increased by 7% year over year. State Street\u0027s assets under custody increased 16% year over year to $53.8 trillion, primarily due to higher market levels and flows. Assets under management in the fourth quarter, meanwhile, increased 20% to $5.7 trillion. However, net income of $747 million declined 5% year over year. State Street\u0027s GAAP earnings per share of $2.42 missed expectations of $2.45 per share. State Street\u0027s overall expenses increased 12%, which the company largely attributed to a $226 million repositioning charge. Read more coverage of corporate earnings here.           Today at 1:05 PM UTC Karen Friar  Morgan Stanley sees 70% surge for ASML shares in its bull case   Morgan Stanley has laid out its bullish case for ASML (ASML, ASML.AS), saying in the most optimistic scenario the stock has a 70% rally ahead as chipmakers ramp up spending to meet soaring AI demand. Bloomberg reports:     Read more here.          Today at 12:34 PM UTC Jenny McCall  PNC Financial earnings beat revenue estimates   PNC Financial (PNC) stock rose 3% before the bell after reporting fourth quarter earnings on Friday. The bank\u0027s earnings per share (EPS) came in at $4.88, beating analysts\u0027 estimates of $4.19. Revenue for the quarter also topped estimates, coming in at $6.1 billion, compared to the consensus estimate of 5.95 billion.  Investing.com reports:    Read more here.            Today at 12:01 PM UTC Karen Friar  China’s $1.2 trillion windfall quietly seeps into global markets   Bloomberg reports: A record trade surplus racked up by China is washing up around the world, as export earnings that once ended up in state coffers instead fund massive private purchases of overseas securities and business expansion abroad. Rather than leaving most of last year’s $1.2 trillion windfall in the hands of the central bank, some two-thirds of the foreign assets sourced primarily from global trade ended up with companies, individuals and state lenders. That brings with it the risk of a sudden capital reversal that China doesn’t immediately control, especially in a world where the yuan is allowed to strengthen. Investors comprising China’s so-called non-official sector saw their holdings of assets abroad soar by more than $1 trillion in the first three quarters of last year — according to the latest available data from China’s currency market regulator — more than double the annual average growth in the past decade.  Putting that money to work last year resulted in a $535 billion surge in Chinese private purchases of overseas securities like US stocks, European bonds and mutual funds, Bloomberg calculations show, though a more detailed geographical breakdown of the investments isn’t available. The increase through September outpaced any full-year increase over the past two decades and was far more than poured out of China in the form of direct investments used to build factories and warehouses or expand staffing abroad. Read more here.          Today at 11:34 AM UTC Jenny McCall  Premarket trending tickers: Micron, J.B. Hunt Transport Services, and Coupang   Micron (MU) shares edged higher by 6% in premarket. The rise follows the news that former TSM co-CEO Mark Liu had bought Micron stock. Micron\u0027s director, Teyin Liu, also purchased 23.2K shares of common stock.  J.B. Hunt Transport Services, Inc. (JBHT) stock fell 5% during premarket trading on Friday after reporting lower quarterly revenue. The logistics company said its cross-country shipments had declined. Coupang (CPNG) stock rose 4% before the bell on Friday. The online retail giant was hit by a cyberattack at the end of last year, which forced its CEO to step down.          Today at 11:27 AM UTC Jenny McCall  \u0027Real nightmare scenario\u0027: How Nvidia\u0027s China struggles could hurt its competitive edge   Nvidia\u0027s (NVDA) China business continues to feel the strain despite President Trump allowing Nvidia to sell its advanced H200 chips to Beijing; the AI heavyweight still grapples with geopolitical hurdles that could harm its competitive advantage. Yahoo Finance\u0027s Laura Bratton and Daniel Howley look at the latest problem to plague the Mag 7 giant. NasdaqGS - Delayed Quote • USD     (NVDA)           Follow           View Quote Details      187.05  \u002B3.91  (\u002B2.13%)   At close: January 15 at 4:00:02 PM EST           Advanced Chart           Read more here.            Today at 10:59 AM UTC Karen Friar  Silver falls after US pauses tariffs, but still heads for hefty weekly gain   Silver dropped on Friday after the US held off from putting import tariffs on critical minerals, but was still up more than 15% for the week on surging demand for precious metals. COMEX - Delayed Quote • USD     (SI=F)           Follow           View Quote Details      88.41  -3.94  (-4.26%)   As of 9:01:31 AM EST. Market Open.           Advanced Chart      Bloomberg reports:    Read more here.          Today at 10:42 AM UTC Jenny McCall  Canada, breaking with US, agrees to cut tariff on Chinese EVs in return for lower tariffs   Canadian Prime Minister Mark Carney announced on Friday that Canada and China have reached a deal for Beijing to cut tariffs on its canola by March 1, in a sign that the countries\u0027 trade rift, which disrupted crop flows, is starting to thaw. In return, Canada agreed to cut tariffs on Chinese electric vehicles. Canada will allow up to 49,000 Chinese EVs at a tariff of 6.1%, Carney said after talks with China\u0027s leader, President Xi Jinping. This is the first visit from a Canadian prime minister since 2017, as Canada seeks to build its strategic alliances with its second-largest trading partner after the US. It is also a sign that China may start to rebuild some of its strategic allies, as well as a that Canada may be breaking from the US.  Bloomberg News reports:     Read more here.            Today at 9:42 AM UTC Karen Friar  Treasury market\u0027s historic inertia is making investors anxious   Bloomberg reports: The 10-year Treasury note’s (^TNX) yield is headed for a fifth straight week of minimal change, rivaling its longest stretch of inertia in the past two decades. Since 2006, the median weekly range for 10-year yields has been 16 basis points. For the past five weeks, it’s been less than 10 basis points, the longest comparable stretch since 2020. The trend — a function primarily of expected stability in US monetary policy — is stoking anxiety among bond-market investors because previous instances of constricted yield ranges have been followed by selloffs.  The 10-year note’s yield range of between 4.1% to 4.2% since mid-December has survived risk events including the December employment data, the US Justice Department’s actions against Fed Chair Jerome Powell and the prospect of American military action in Iran, Ian Lyngen, interest-rate strategist at BMO Capital Markets, observed in a report. “Investors have been left to ponder what would be required to push 10-year yields to 4.25% or 4.05%,” Lyngen wrote. Read more here.           Today at 6:25 AM UTC Rian Howlett  Oil prices drop as reduced chances of US intervention in Iran\u0027s attack on civilians lower global supply fears   Reuters reports: NY Mercantile - Delayed Quote • USD     (CL=F)           Follow           View Quote Details      59.87  \u002B0.79  (\u002B1.34%)   As of 9:01:30 AM EST. Market Open.        CL=F BZ=F    Advanced Chart      Oil prices fell in Asian trade on Friday, extending losses from the previous session, as concerns about supply risks eased after the ​likelihood of a U.S. strike on Iran receded. Brent (BZ=F) was down 21 cents, or ‌0.3%, to $63.55 per barrel, while U.S. West Texas Intermediate (CL=F) fell 15 cents, or 0.3%, to $59.04 per barrel at ‌0418 GMT. Both Brent and WTI rose to multi-month highs this week after protests flared up in Iran and U.S. President Donald Trump signalled the potential for strikes on the nation. Brent prices were still set for a fourth week of gains. Late on Thursday, however, Trump said ⁠Tehran\u0027s crackdown on the protesters was ‌easing, allaying worries about possible military action that could disrupt oil supplies. Brent prices have given back earlier gains but remain higher than a ‍week ago, with the decline in prices spurred by Trump\u0027s statement that he would hold off on military strikes on Iran, BMI analysts said in a note. Read more here.            Today at 4:27 AM UTC Rian Howlett  Musk lawsuit against Open AI and Microsoft set to go to trial   Bloomberg reports:      Read more here,            Today at 1:21 AM UTC Rian Howlett  Silver prices slip from record after critical minerals tariff walked back   Bloomberg reports: COMEX - Delayed Quote • USD     (SI=F)           Follow           View Quote Details      88.41  -3.94  (-4.26%)   As of 9:01:31 AM EST. Market Open.           Advanced Chart          Read more here.",
          "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-climb-as-wall-street-gets-set-to-wrap-up-volatile-week-234227757.html",
          "publishedAt": "2026-01-15T23:42:27+00:00"
        },
        {
          "id": 2,
          "title": "Small-cap records, chip stock gains, silver: Market Takeaways",
          "body": "US stocks (^DJI, ^IXIC, ^GSPC) close Thursday\u0027s session higher following AI optimism tied to the US trade deal with Taiwan.   Yahoo Finance Markets and Data Editor Jared Blikre breaks down the biggest market themes from today’s trading day, including how small-cap indexes are reaching record highs, stock movements in semiconductor chip manufacturers, and price trends in silver (SI=F).   To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.          Video Transcript      00:00     Speaker A     here with the train day takeaways is Yahoo finance\u0027s Jared Blicry. Jared.    00:02     Jared Blikre     Thanks. We got to talk some records first and uh let\u0027s just get to that on the Wi-Fi interactive records galore. I\u0027m going to start with the S\u0026P 500 which did not close at a record, but I just want to show you the last nine months. This goes almost back to those uh scary April post-liberation day lows. You can see it\u0027s up uh about 28, almost 30%, but it\u0027s essentially flat lined over the last few months. Meanwhile, check out the Russell 2000 small caps, what they\u0027re doing. This already went through its flat line consolidation period and it is broken to the upside. Here\u0027s the S\u0026P 400. These are mid caps in a very similar chart right there. It was going flat line forever, then it used the prior ceiling as a floor and then it just took off. Also want to show you the micro caps because those are hitting record highs too recently and look at that, 58%. That\u0027s more than double the S\u0026P 500. There\u0027s also uh an Ishares ETF called IWC, that\u0027s the ticker. It is up 10 straight days. You have not seen that since September of 2017. So smaller is bigger than large right now. And that was kind of my thesis from yesterday and this is just an extension of it.    01:21     Speaker A     You know what else we have to talk about? Chips.    01:22     Jared Blikre     Yes. Taiwan is in the news. So chips are ripping here. Semis are soaring and let\u0027s take a look at a heat map of the chip sector. I\u0027m going to show you what happened today first, and we\u0027re talking about what? Another half a trillion in in investment in uh domestic chips. And here we see Taiwan Semi up 4%, Lamb research up 4%. Let me just show you the year to date here. We\u0027re only midway through January. I\u0027m going to sort by performance here so you can see some of the outsized winners. SanDisk up 72%. We\u0027re halfway through January. Applied material up 43%, Intel up 30%, and the list goes on. You you see a few in the red here, but uh not many, not many at all. Broadcom, I think is a big uh uh exception and so is Nvidia. Nvidia\u0027s just barely positive there. So you put it all together, chips looking very bullish.    02:18     Speaker A     You know it goes into those chips?    02:18     Jared Blikre     Silver.    02:19     Jared Blikre     Ah, yes. And guess what? Guess what hit a record high today? Silver futures once again up to $93 per ounce. And uh I was checking on the gold to silver ratio. That\u0027s one of the ways that people measure silver prices and gold prices on a comparative basis and it is down to 51 from over 100 about six or nine months ago. So let\u0027s see if we can find silver SI equals F in here. Well, even if we can\u0027t, you\u0027re just going to have to take my word it hit $93 and change. Um, and I do want to get to this because we were talking to Kenny Glick. He is the owner of Hit the bid. He operates a trading room, uh big silver proponent and he carries away silver he carries silver coins in his pocket every day. He had to say this about the silver rally.    03:00     Speaker B     And that\u0027s a frightening thing when it\u0027s a crowded trade. Yes. But also on the flip side, when people see this monster parabolic move, the shorters get involved. And again. And then they\u0027re the fuel. Yeah show. Yes. Yes, and the shorters are generally they\u0027re wrong, okay? Because they see this move just like in the markets, right? Just because something\u0027s gone up parabolically, doesn\u0027t mean it has to come crashing back down. It can consolidate just like that whole overbought thing. If something\u0027s overbought, sure, but if it stays overbought for a given amount of time, it\u0027s no longer over. The overboughtness is kind of dissipates.    03:47     Jared Blikre     And that episode is going to drop uh Tuesday. So we got a few days until then, but uh look out for it. Kenny Glick that was his sixth appearance on the show. And    03:59     Jared Blikre     I found the silver chart. Thank you, producers, in my ear. It was in the upper right the whole time. Year to date, it is up 30%. Let\u0027s check out the one year. 194%. So basically the price has tripled over the last year. Put on two years and you got 302%. So quadrupled and that looks parabolic. And like Kenny was just saying, markets can go parabolic for a long period of time, but silver has been consolidating for a long period of time. And when it breaks out from a multi-decade base, uh this thing\u0027s got some juice. That\u0027s my thesis.    04:31     Speaker A     You want to end here on Bitcoin?    04:32     Jared Blikre     Let\u0027s do that. We got a little time left. So let\u0027s get the crypto board up. And Bitcoin is down 2%. I was just saying that it uh Bitcoin had just confirmed a short-term uptrend and hard to see on this chart, but basically, it broke this resistance level. So it is now stair stepping up. It\u0027s using the prior ceiling as a floor. That\u0027s what you want to see, so that\u0027s normal, but I want to see 95,000 hold and this is the fledgling rally that the bulls have to win. As always, I do like to include the levels that I\u0027m watching here. The liner, the make or break line for me is 110,000, so 15,000 away from that. You break that, it\u0027s I think an easy trip to new highs.    05:13     Speaker A     All right, thank you, buddy. Appreciate it.    05:14     Jared Blikre     You bet.",
          "link": "https://finance.yahoo.com/video/small-cap-records-chip-stock-221522267.html",
          "publishedAt": "2026-01-15T22:15:22+00:00"
        },
        {
          "id": 3,
          "title": "Stock market today: Dow, S\u0026P 500, Nasdaq rise as TSMC boosts AI hopes, bank stocks rally",
          "body": "US stocks rose on Thursday, in a recovery from back-to-back losses as chip linchpin TSMC\u0027s strong outlook boosted AI hopes and bank stocks rallied after upbeat earnings reports from two Wall Street heavyweights.   The tech-heavy Nasdaq Composite (^IXIC) edged up nearly 0.3%, paring more significant gains from earlier in the session. The S\u0026P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) gained 0.3% and about 0.6%, respectively, bouncing back from two consecutive days of losses for the Wall Street indexes.   Nasdaq GIDS - Delayed Quote • USD     (^IXIC)           Follow           View Quote Details      23,530.02  \u002B58.27  (\u002B0.25%)   At close: January 15 at 5:15:59 PM EST        ^IXIC ^GSPC ^DJI    Advanced Chart        TSMC (TSM), the world\u0027s largest contract chipmaker, posted a 35% jump in fourth quarter profit on Thursday thanks to the AI boom. The major supplier to Nvidia (NVDA) and Apple (AAPL) said it plans to ramp up investment to $56 billion in 2026, a sign of confidence in sustained Big Tech spending on AI buildouts. Shares in the Taiwanese company jumped, stoking a rally in chip-related stocks such as ASML (ASML). Nvidia also bounced back from Wednesday\u0027s decline, ending the day up over 2%.          The mood marked a reversal after tech led stocks lower on Wednesday, which dragged on indexes and promised to revive a weeks-long rotation out of megacaps into value names.   Meanwhile, investors assessed a fresh batch of big bank earnings. Goldman Sachs (GS) and Morgan Stanley (MS) saw their profits surge, both capitalizing on a dealmaking boom to end the year. Peer BlackRock (BLK) capped 2025 with a record $14 trillion in assets as its earnings beat. The three firms all saw shares surge.   NYSE - Delayed Quote • USD     (GS)           Follow           View Quote Details      975.86  \u002B43.19  (\u002B4.63%)   At close: January 15 at 4:00:02 PM EST        GS MS BLK    Advanced Chart        Elsewhere, oil prices on Brent crude and West Texas Intermediate crude sank by roughly 4% each through Thursday morning amid signs the US is backing away from a military response in Iran. President Trump said Wednesday he had been told authorities there will stop killing protesters.   Silver (SI=F) fell but pared losses by afternoon trading following an explosive record-setting rally that recently pushed the metal\u0027s total market value above $5 trillion.   LIVE COVERAGE IS OVER 27 updates           Thu, January 15, 2026 at 9:02 PM UTC Ines Ferré  Dow, S\u0026P 500, Nasdaq inch higher on AI hopes, bank stocks rise   Stocks gained on Thursday after chip manufacturer TSMC\u0027s latest results reassured investors that the AI cycle is accelerating, and bank earnings came in strong. The Dow Jones Industrial Average (^DJI) led the gains with Industrials, Materials, and Energy as the outperforming sectors. The S\u0026P 500 (^GSPC) also rose almost 0.3%. The tech-heavy Nasdaq Composite (^IXIC) increased nearly 0.3% as several semiconductor stocks jumped following TSMC\u0027s latest quarterly results. Bank earnings from Goldman Sachs (GS) and Morgan Stanley (MS) came in strong, sending the sector higher. The metals complex took a breather on Thursday following a monster rally. Meanwhile, oil prices fell 4% as the threat of US military action against Iran eased following President Trump’s latest remarks over how Tehran is handling anti-government protests. Nasdaq GIDS - Delayed Quote • USD     (^IXIC)           Follow           View Quote Details      23,530.02  \u002B58.27  (\u002B0.25%)   At close: January 15 at 5:15:59 PM EST        ^IXIC ^DJI ^GSPC    Advanced Chart               Thu, January 15, 2026 at 8:50 PM UTC Ines Ferré  AI spending to hit $2.53 trillion in 2025, $3.33 trillion in 2027   Yahoo Finance\u0027s Dan Howley reports:     Read more here.           Thu, January 15, 2026 at 8:30 PM UTC Ines Ferré  Kansas City Fed\u0027s Schmid: Cutting rates could make inflation worse   Yahoo Finance\u0027s Jen Schonberger reports:   Read more here.           Thu, January 15, 2026 at 8:00 PM UTC Ines Ferré  Oil tumbles 4% as Trump remarks ease investor worries of a US strike against Iran   Oil prices fell 4% on Thursday as the threat of US military action against Iran eased following President Trump’s latest remarks over how Tehran is handling anti-government protests. International pricing benchmark Brent crude (BZ=F) settled at $63.79 per barrel, while West Texas Intermediate (CL=F) dropped to $59.19 per barrel. Read more here.            Thu, January 15, 2026 at 7:15 PM UTC Jake Conley  BofA: Transition investing is the \u0022perfect \u0027AI bubble\u0027 hedge\u0022   Transition investing — investments in sectors crucial to the AI revolution — is the \u0022perfect\u0022 hedge for investors worried that the AI boom might be a bubble, according to equity strategists at Bank of America. Fears that AI — which BofA called a \u0022fundamental revolution that is about to change everything\u0022 — are falling, the strategists wrote. However, \u0022concentrated capital in AI-linked names heightens vulnerability to factor drawdowns, policy shifts, rate shocks, and power-supply constraints.\u0022 Transition investing, BofA said, offers \u0022a way to invest in AI, without investing directly with AI.\u0022 The investment strategy centers around sectors such as transition metals and defense that, while systemically important to the AI buildout, remain strong on their own under growing demand dynamics. On the infrastructure side of the AI boom, power generation and the industrial metals — copper, aluminum, silver, and others — needed to construct and provide electricity to the growing array of data centers make investments in those sectors strong directional bets on AI, BofA said. Security resilience, powered by the defense sector, is also seeing growing demand as nations expand their defense budgets and more attention is paid to next-generation combat systems, the strategists said. \u0022Transition strategies like defense, infrastructure, and transition metals are all critical to the AI revolution,\u0022 the strategists wrote. \u0022However, share prices in these sectors offer relative resilience against AI-driven swings, anchored by policy, geopolitics, and supply chain fundamentals.\u0022 BofA also noted that the defense, infrastructure, and transition metals sectors have maintained a market correlation to AI of less than 50%. Some of BofA\u0027s recommended equities include BAE Systems (BAESF), Vulcan Materials (VMC), Tencent Holdings (TCEHY), Elm Company (7203.SR), CMOC Group (3993.HK), and HD Hyundai Electric (267260.KS).          Thu, January 15, 2026 at 6:30 PM UTC Laura Bratton  Moody\u0027s says an AI bubble burst would \u0027have far- ranging credit consequences\u0027   Moody\u0027s analysts published a report on Thursday about what would occur in the event of an AI bubble bursting. Though the credit rating agency said it\u0027s unclear whether the market is in a bubble, analysts wrote that if a hypothetical burst occurs and AI-related companies lose 40% of their value, it would have \u0022far-ranging credit consequences.\u0022 \u0022An equity downturn would erode household wealth, weakening the credit quality of companies in sectors providing nonessential goods and services,\u0022 analysts said. \u0022Private credit, an emerging source of AI financing, would also come under pressure, while the ripple effects could extend to pension funds, insurers, and banks, particularly regional lenders with exposure to tech-related real estate.\u0022 The analysts said a market drawdown could be spurred by a failure for companies to create meaningful productivity gains from AI, a miss by an AI bellwether such as Nvidia, or a broader economic slowdown. They noted that such a downturn would slow AI adoption but not halt it.  Moody\u0027s said Big Tech firms such as Microsoft (MSFT) and Alphabet (GOOG, GOOGL) would see limited impacts due to their diversified business models and creditworthiness.           Thu, January 15, 2026 at 5:50 PM UTC Grace O\u0027Donnell  Oil tumbles 4% as Trump remarks ease investor worries of a US strike against Iran    Oil prices fell more than 4% on Thursday as the threat of US military action against Iran appeared to have eased. International pricing benchmark Brent crude (BZ=F) slipped to around $63.40 per barrel, while West Texas Intermediate (CL=F) traded near $59 per barrel. Crude prices fell sharply on Wednesday afternoon after President Trump said, “We’ve been told that the killing in Iran is stopping.\u0022 That helped cool expectations of a potential US intervention that stemmed from Trump\u0027s earlier remarks that Iran’s ruling regime would “pay a big price\u0022 for its violent response to anti-government protests.  Yahoo Finance\u0027s Ines Ferré reports:     Read more here.          Thu, January 15, 2026 at 5:05 PM UTC Laura Bratton  Nvidia, chip stocks jump as supplier TSMC dismisses AI bubble fears   Chip stocks jumped in early trading on Thursday as Nvidia\u0027s (NVDA) chip manufacturer TSMC (TSM) gave financial forecasts that signaled strong demand for AI and its CEO dismissed bubble fears. NasdaqGS - Delayed Quote • USD     (NVDA)           Follow           View Quote Details      187.05  \u002B3.91  (\u002B2.13%)   At close: January 15 at 4:00:02 PM EST        NVDA AVGO AMD    Advanced Chart      “Our conviction in the multiyear AI megatrend remains strong, and we believe the demand for semiconductor[s] will continue to be very fundamental,\u0022 said C.C. Wei. Nvidia stock rose 3% to erase the previous day’s loss, while rival chipmakers AMD (AMD) and Broadcom (AVGO) shares jumped 3% and 2%, respectively. Shares in Micron (MU), which supplies memory for Nvidia’s AI systems, as well as those in chip architecture designer Arm (ARM) advanced more than 3%. Read about TSMC\u0027s results and Wei\u0027s commentary on the AI market here.          Thu, January 15, 2026 at 4:20 PM UTC Jake Conley  State Street shares rally on push into digital assets   Shares in financial services giant State Street (STT) rallied Thursday morning, picking up more than 1% on news that the firm is readying a collection of cryptocurrency and tokenized products for its clients. The bank will shortly begin offering money market, ETF, and cash products, including tokenized deposits and stablecoins, according to Bloomberg.  The move comes as State Street recently began working with the digital assets strategy hedge fund Galaxy Digital to launch a tokenized private liquidity fund for client investments. State Street also joins a growing cohort of financial institutions offering crypto exposure or crypto-related products to clients. BNY Mellon (BK) has launched a tokenized deposit service, and asset managers, including JPMorgan Chase (JPM) and Fidelity Investments, have launched tokenized money market funds, Bloomberg reported.           Thu, January 15, 2026 at 3:49 PM UTC Grace O\u0027Donnell  Barr: DOJ probe is \u0027an assault on the independence of the Fed\u0027   Federal Reserve governor Michael Barr said that the Justice Department\u0027s criminal inquiry into the central bank and the White House\u0027s accusations against Fed governor Lisa Cook are \u0022an assault on the independence of the Fed.\u0022 \u0022I think these are just examples of the ways in which the independence of the Fed is being challenged,\u0022 Barr told Yahoo Finance\u0027s Jennifer Schonberger in an interview on Thursday (see video below).  Barr stated that the Fed is acting \u0022only for economic reasons\u0022 and according to its mandate of price stability and maximum employment, despite the increased pressure. The Justice Department served subpoenas to the Fed last Friday, specifically focused on Chair Jerome Powell\u0027s testimony before Congress about the renovations to its Washington, D.C., headquarters. Powell responded with a video message, in which he defended his record and said that the criminal probe was part of President Trump\u0027s ongoing campaign to pressure the central bank to lower interest rates. Read more here.          Thu, January 15, 2026 at 3:15 PM UTC Jake Conley  Salesforce sheds 10% since start of the year on AI\u0027s threat to software companies    Salesforce (CRM) has seen its shares shed 10% since the beginning of the year as the company has attempted to fight off investor fears that AI will cut into the industry-leading CRM provider and other software giants. Yahoo Finance executive editor Brian Sozzi reports:     Read more here.          Thu, January 15, 2026 at 2:37 PM UTC Jake Conley  Stocks rise at the market open on Thursday on AI outlook, geopolitical cool-off   US stocks opened higher on Thursday as investors rallied for a recovery from back-to-back losses on a strong outlook from chip giant TSMC, signaling strength for the AI trade. The tech-heavy Nasdaq Composite (^IXIC) picked up around 0.8% to lead the way higher, while the S\u0026P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) gained 0.7% and 0.3%, respectively, following a second straight day of losses for the Wall Street indexes. Nasdaq GIDS - Delayed Quote • USD     (^IXIC)           Follow           View Quote Details      23,530.02  \u002B58.27  (\u002B0.25%)   At close: January 15 at 5:15:59 PM EST        ^IXIC ^GSPC ^DJI    Advanced Chart      In commodities, oil prices on Brent crude and West Texas Intermediate crude fell by roughly 4% each through Thursday morning as Trump signaled a slowdown on potential military action in Iran. President Trump said Wednesday that he had been assured security forces would stop killing protesters. Moving in tandem with oil, store-of-value leaders gold (GC=F) and silver (SI=F) also fell on a cooling geopolitical environment and an announcement from the White House that President Trump will not be implementing tariffs on critical mineral imports.          Thu, January 15, 2026 at 2:25 PM UTC Jake Conley  Rare earth stocks split after Trump says he\u0027ll delay critical mineral tariffs   Rare earth and critical minerals stocks traded on mixed footing in premarket trading on Thursday morning after President Trump said he would seek to negotiate trade agreements with foreign nations on the minerals instead of imposing tariffs. Shares in USA Rare Earth (USAR) and MP Materials (MP) fell by roughly 3% and 1.8%, while shares in Lithium Americas Corp. (LAC) shed 0.5%. Trilogy Metals Inc. (TMQ), which operates mining sites in Alaska, rallied by 3.2%.  In a proclamation Wednesday night, President Trump said the Department of Commerce and the Office of the US Trade Representative shall \u0022jointly pursue negotiation of agreements ... to address the threatened impairment of the national security with respect to imports of [processed critical minerals and derivative products] from any country.\u0022 The president also said Secretary of Commerce Howard Lutnick and Trade Representative Jameson Greer should consider implementing price floors for trading in critical minerals, alongside other restrictive measures. While holding off on implementing a tariff scheme in the meantime, Trump noted that \u0022it may be appropriate to impose import restrictions, such as tariffs, if satisfactory agreements are not reached in a timely manner.\u0022 The US, Trump said, was \u0022100 percent net-import reliant for 12 critical minerals, and 50 percent or greater net-import reliant for a further 29 critical minerals\u0022 in 2024.\u0022 And even where the US does have mining capacity for certain minerals, the country, \u0022lacks the domestic processing capacity to avoid downstream net-import reliance.\u0022 The Department of Defense has taken equity stakes in both MP Materials and Trilogy Metals, while the Department of Energy has invested in Lithium Americas.          Thu, January 15, 2026 at 2:10 PM UTC Brett LoGiurato  Jobless claims unexpectedly fall amid seasonal volatility   US weekly jobless claims unexpectedly fell last week to their lowest level since November, as seasonal volatility seemingly continued to grip the labor market measure. Jobless claims have remained volatile on a week-to-week basis since the Thanksgiving holiday — and really since the end of the government shutdown. Reuters reports:   Read more here.          Thu, January 15, 2026 at 1:59 PM UTC Jake Conley  Goldman Sachs sets new Wall Street record in equity trading revenue   Goldman Sachs (GS) vaulted past its own equity trading revenue highs, setting a new Wall Street record and far exceeding expectations in its fourth quarter earnings. The global investment bank\u0027s equity trading desk posted revenue of $4.31 billion for the fourth quarter, coming in 25% higher than the same quarter last year and breaking the bank\u0027s own record set in the second quarter of 2025. Analysts had expected $3.65 billion in equity trading revenues, according to Bloomberg consensus estimates. Shares in Goldman Sachs initially jumped by around 1% in premarket trading before reversing around 1.7%. NYSE - Delayed Quote • USD     (GS)           Follow           View Quote Details      975.86  \u002B43.19  (\u002B4.63%)   At close: January 15 at 4:00:02 PM EST           Advanced Chart      Elsewhere at Goldman Sachs, led by CEO David Solomon, the bank\u0027s fixed income, currencies, and commodities trading desk posted revenue of $3.11 billion, up 12.5% from a year ago and exceeding analyst expectations. Investment banking fees rose 25% from a year ago to $2.58 billion but missed analyst expectations of $2.66 billion, according to Reuters.          Thu, January 15, 2026 at 1:51 PM UTC Laura Bratton  Intel upgraded by Citi, acknowledged as a \u0027formidable competitor\u0027 by TSMC   Intel (INTC) got its second upgrade this week on Thursday as Citi (C) analysts raised their rating on the stock to Neutral from Sell. Analyst Atif Malik said that supply tightness in TSMC\u0027s (TSM) packaging business would be a tailwind for the US chipmaker. Packaging refers to when a finished chip is wired up and placed into a protective shell so it can be used in computers and electronics. Intel\u0027s advanced packaging business has recently attracted interest from Big Tech hyperscalers for their custom AI chips, KeyBanc analyst John Vinh said this week in his own note upgrading Intel shares.  Citi\u0027s Malik also said he believes Intel will get front-end foundry customers as yields on its 18A-P and 14A manufacturing processes improve. In other words, he thinks companies will eventually, actually pay Intel to manufacture their chips rather than just package them, which is far more lucrative. Meanwhile, Intel got a nod from its revered competitor, TSMC, which leads the chip manufacturing industry and produces leading edge chips for Nvidia. Asked whether the US government investment in Intel and the chipmaker\u0027s partnership with Nvidia was a competitive concern for TSMC, CEO C.C. Wei said he wasn\u0027t worried during a call with analysts early Thursday morning. But, he said: \u0022We have a competitor — no doubt about it — that\u0027s a formidable competitor.\u0022 \u0022But first, it takes time; two, we don\u0027t underestimate their progress.\u0022 Such acknowledgement from industry leader TSMC indicates how far Intel\u0027s struggling manufacturing business has come, as the company\u0027s turnaround is still questioned by many on Wall Street. The stock rose fractionally Thursday and is up 154% over the past year.           Thu, January 15, 2026 at 1:15 PM UTC Karen Friar  Chip gearmaking stocks rise after TSMC\u0027s upbeat outlook   Shares of chip equipment makers rallied before the bell on the heels of a confidence boost from AI bellwether TSMC (TSM). The Taiwanese contract chipmaker\u0027s outlook and record Q4 profit lifted optimism that the AI-fueled Big Tech buildout will keep on stoking demand. US-listed shares of ASML (ASML), a big supplier to TSMC, rose over 6% after the Dutch gear maker\u0027s market value topped $500 billion for the first time in Amsterdam.  Lam Research (LRCX) surged almost 9%, while fellow US equipment provider Applied Materials (AMAT) rose around 8%. Meanwhile, shares of TSMC customer Nvidia (NVDA) also moved up, but their advance was more muted at around 1%.           Thu, January 15, 2026 at 1:00 PM UTC   Delta\u0027s premium cabin success is a metaphor   Yahoo Finance\u0027s Hamza Shaban writes:       Read more here in the takeaway from today\u0027s Morning Brief.           Thu, January 15, 2026 at 12:45 PM UTC Karen Friar  Crypto firms buoyed by Trump get rocks as crucial bill is delayed   Bloomberg reports:    Stablecoins are a key pillar of the cryptoasset universe, and usage is booming after the US passed legislation governing them in July. After their success helping get Trump elected and the stablecoin bill passed, crypto executives now fear the impasse over tokens pegged to the dollar could prevent the US regulatory framework from catching up with other markets. “This delay is concerning as it creates a probability for the US to be one of the only major digital assets hubs without a clear capital markets rulebook in 2026,” said Dea Markova, director of policy at Fireblocks, a crypto custody services provider. Read more here.          Thu, January 15, 2026 at 12:44 PM UTC Jenny McCall  Penumbra stock jumps on $14.5B Boston Scientific deal   Penumbra (PEN) stock rose 13% before the bell following the news that Boston Scientific (BSX) would purchase the medical device company for $14.5 billion in order to expand its vascular pipeline. Boston Scientific (BSX) shares fell 2% following the announcement.  Reuters reports:  Read more here.             Story Continues",
          "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-tsmc-boosts-ai-hopes-bank-stocks-rally-195049176.html",
          "publishedAt": "2026-01-15T21:00:48+00:00"
        },
        {
          "id": 4,
          "title": "4 semiconductor stocks giving the AI boom \u0027more legs\u0027",
          "body": "The AI supercycle is far from exhausted, and semiconductor companies like industry titan TSMC (TSM) are among the catalysts to watch.   \u0022This earnings report, really more than anything, supports the idea that [the AI boom] is going to continue to move forward,\u0022 Victoria Fernandez, chief market strategist at Crossmark Global Investments, told Yahoo Finance\u0027s Opening Bid.          According to Fernandez, the great \u0022rotation\u0022 out of Big Tech might finally \u0022start to slow down a little bit.\u0022 While market skeptics spent the past quarter betting on a broad exit from the \u0022Magnificent Seven,\u0022 a new wave of earnings from the semiconductor sector signals \u0022there are more legs\u0022 to the AI race.   Other key players to watch include ASML (ASML), Applied Materials (AMAT), and Lam Research (LRCX), as Fernandez points to the firms\u0027 respective \u0022strong earnings.\u0022   That renewed optimism is largely due to a fundamental shift in how the market views the picks and shovels of the AI era. For months, investors feared that AI demand might be a bubble nearing its burst. However, the latest data from these four companies — which build the hardware for Big Tech — tells a different story of rising capital expenditures, expanding margins, and relentless sales growth.   Leading that charge is TSMC, the world\u0027s most critical chip foundry, which dominates advanced chip production for giants like Nvidia (NVDA), Apple (AAPL), and Advanced Micro Devices (AMD).     TSMC CEO C.C. Wei and Nvidia CEO Jensen Huang pose for photos at TSMC\u0027s annual sports day in Hsinchu, Taiwan, on Nov. 8, 2025. (Reuters/Ann Wang)  · REUTERS / Reuters    TSMC kicked off the new year by delivering blockbuster Q4 earnings today. For the period, revenue came in at $33.73 billion, a 25% year-over-year increase, beating consensus estimates of $32.8 billion, according to Bloomberg data. Earnings per share reached $3.15, up 8% year over year, surpassing the expected $2.90. TSMC stock has risen over 70% in the past year.          The company announced it had earmarked up to $56 billion in capital expenditures for 2026. This aggressive spending plan acts as a massive \u0022buy\u0022 signal for the entire supply chain, per Fernandez, suggesting that the world\u0027s biggest tech players are doubling down on infrastructure, rather than pulling back.   The higher-for-longer spending cycle has revitalized the three other key suppliers. Take ASML, the sole provider of the lithography machines required to make advanced AI chips. Its market cap surged past the $500 billion mark on the back of TSMC\u0027s news. Shares of ASML are up over 80% in the past 12 months.    The support for these suppliers was visible in premarket trading, where Applied Materials and Lam Research shares were up 8% and 6%, respectively. These companies represent the infrastructure layer that must be built before any software-based AI gains can be realized.\n\nIf the market is starting to look at these specialized components within the sector rather than just the megacap names, then these AI players may be just warming up.   StockStory aims to help individual investors beat the market.    Francisco Velasquez is a Reporter at Yahoo Finance. Follow him on LinkedIn, X, and Instagram. Story tips? Email him at francisco.velasquez@yahooinc.com. Click here for the latest technology news that will impact the stock market Read the latest financial and business news from Yahoo Finance",
          "link": "https://finance.yahoo.com/news/4-semiconductor-stocks-giving-the-ai-boom-more-legs-175135867.html",
          "publishedAt": "2026-01-15T17:51:35+00:00"
        },
        {
          "id": 5,
          "title": "TSMC earnings: Will suppliers overshadow the Mag 7 this year?",
          "body": "Taiwan Semiconductor Manufacturing Company (TSM) reported fourth quarter earnings and guidance that beat analyst estimates. Notably, TSMC increased its capital expenditures (CapEx) budget for the year to the $52–56 billion range.   Crossmark Global Investments chief market strategist Victoria Fernandez, Yahoo Finance Senior Reporter Brooke DiPalma, and Yahoo Finance Senior Reporter Ines Ferré join Opening Bid host Brian Sozzi to discuss the results and what they could mean for suppliers and chipmakers in the artificial intelligence (AI) trade.   To watch more expert insights and analysis on the latest market action, check out more Opening Bid.          Video Transcript      00:00     Speaker A     TSMC, big quarter, big guidance. Shouldn\u0027t this quarter just put to bed the weakness we\u0027re seeing in Mag 7 out of the gate this year?    00:10     Victoria     You know, it\u0027s it\u0027s funny the questions that have been surrounding the whole AI boom. I think this earnings report really more than anything supports the idea that it\u0027s going to continue to move forward. And so yes, it should support some of the Mag 7 names. You saw the support already for the suppliers for um TSMC. So we look at ASML, we look at applied materials, Lamb Research, all of those stocks up in pre-trading because of such strong earnings that we saw here. So I think what it does is this rotation that we have been seeing out of tech, out of Mag 7, especially out of software, um and tech, into other areas of the market. Maybe that starts to slow down a little bit as people say, wait a minute, perhaps there are more legs to this than what we were thinking, or they start looking at other components within the AI um sector. Like I said, maybe some of the supplier names versus some of the Mag 7, but I do think it gives that whole sector a little bit more support, especially when you\u0027ve got them saying CAPEX is going higher, um their profit margins are going to go higher, sales are up 20%. Lots of good news here for the AI story.    01:21     Speaker A     Brooke, uh Victoria makes up a very good point. TSMC lifting the chip space, but also a lot of the suppliers, too.    01:29     Brooke     That\u0027s right. and what we\u0027re hearing is some of their customers, Nvidia, Apple, Qualcomm, uh Broadcom, AMD as well. And and I think to Victoria\u0027s point is they sort of solidified uh their position or their thoughts on where exactly this market is going in the near term. And actually on their call, what they had said, the CEO saying that they talked to several cloud service providers. They show me the evidence that the AI really does help their business. And that\u0027s sort of solidified what they said was this uh lack of rest. They said they\u0027re they double checked their financial status. They\u0027re very rich. and that sounds much better for the TSMC story. And I think this really just goes to show that this sort of uh, you know, came in as a vote of confidence for this AI momentum. This came in as a suppressant sort of to that investor fear that we\u0027ve seen about that AI bubble risk. And certainly that message from the CEO on the call is why we\u0027re seeing these others move higher this morning as well.    02:28     Speaker A     I\u0027ve said this before, Inez, I still think TSMC needs a better uh corporate logo. Uh they got to update it for this uh AI era. But look, Inez, now we know why Jensen was wearing that alligator black leather coat at CES. He knew this TSMC quarter was going to be big and he\u0027s probably sitting on a big quarter too.    02:41     Inez     Yeah, 100%. and look, just taking a look at what some of the Wall Street commentary on this is like, it\u0027s they\u0027re they\u0027re looking at that CAPEX outlook and saying that this shows that the AI cycle is accelerating. You\u0027ve got Wedbush that is saying that a beat across the board, gross margins, a major positive surprise, a positive surprise there. And also that this company is really firing on all cylinders that it it it is in competitively, it is the leader here. and you\u0027ve got Susquehanna saying something similar that their position is unmatched. And if you take a look at also what the street is looking at for the stock, they\u0027re looking at an average of 382 for the stock, 29 buys, two holds. So you it it speaks to momentum in the industry, in the AI industry as Brooke was just mentioning, but also for the leadership of TSMC.",
          "link": "https://finance.yahoo.com/video/tsmc-earnings-suppliers-overshadow-mag-160000952.html",
          "publishedAt": "2026-01-15T16:00:00+00:00"
        },
        {
          "id": 6,
          "title": "TSMC\u0027s earnings beat: Why 2026 CapEx guidance is the highlight",
          "body": "Taiwan Semiconductor Manufacturing Company (TSM) reported fourth quarter earnings and guidance that beat analyst estimates. Notably, TSMC increased its capital expenditures (CapEx) budget for the year to the $52–56 billion range.   Baird Tech strategist Ted Mortonson joins Morning Brief host Julie Hyman to discuss the earnings print and guidance.   To watch more expert insights and analysis on the latest market action, check out more Morning Brief.          Video Transcript      00:00     Speaker A     Well, Taiwan Semiconductor fueling AI optimism as the chip maker reports fourth quarter results and guidance that topped estimates. Most notably, the company\u0027s better than expected capital expenditure forecast, perhaps welcome news for the AI market. Baird Tech strategist Ted Mortonson is joining us to discuss. Ted, it\u0027s always great to see you. I was indeed struck by that CAPEX forecast. I mean, everybody\u0027s raising their for their CAPEX forecast, it seems. Um and so TSM kicking things off this year, 52 to 56 billion dollars is what it\u0027s expecting. What did you take away from that and from the rest of the results?    00:54     Ted Mortonson     Well, the CAPEX is very interesting. It\u0027s up 32% for 2026, which is a huge number. And what that represents is really the core demand they\u0027re seeing. Um the cloud titans think that TSM is essentially the bottleneck for AI on a a chip manufacturing. So that CAPEX number was above the street and that\u0027s why all the semi cap equipment names are are rallying. But there were some other metrics coming out of the call that are are equally important. Uh TSM\u0027s going to grow at 36% versus the broader foundry index at call it 16%. Uh the other thing is on the high-performance compute side, which is 55% of their revenues, think of that as just Gen AI. 18% of their total revenues are now Gen AI and they can\u0027t meet demand. The last thing is this two nanometer node is the magical node uh from performance and power. Uh they are at least a note and a half ahead uh as it relates to a technology advantage from any of their competition on the foundry side. So they\u0027ve really got core dominance going on.",
          "link": "https://finance.yahoo.com/video/tsmcs-earnings-beat-why-2026-145048110.html",
          "publishedAt": "2026-01-15T14:50:48+00:00"
        },
        {
          "id": 7,
          "title": "Trump places 25% tariff on AI chips with some exemptions",
          "body": "The Trump administration has placed a 25% tariff on “certain advanced computing chips,\u0022 according to a White House statement, with exemptions for chips contributing to the buildout of the US AI infrastructure.   Crossmark Global Investments chief market strategist Victoria Fernandez comments on this announcement.   To watch more expert insights and analysis on the latest market action, check out more Opening Bid.          Video Transcript      00:00     Speaker A     How concerned should investors be about this this ongoing unpredictability by the administration and how do you even go about pricing that in?    00:08     Speaker B     Yeah, it\u0027s difficult to price in things that you don\u0027t know. Um and that\u0027s part of what this is. You just don\u0027t know from day-to-day what announcement you\u0027re going to get. However, I do think in regards to this 25% tariffs, we knew that when the administration approved the sale of chips to China, there was going to be some kind of payback to come along with that. So, I don\u0027t think it\u0027s a huge surprise that we saw this come through. I think the the silver lining in this is that there are so many carve outs to this as you mentioned a little bit earlier. In regards to if it has to do with data centers and startups and public consumption, if it\u0027s, you know, for non-profit, all these different elements get carved, um carved out of this. And Howard Lutnick even has the ability according to the the proclamation that he can add more carve outs to this going forward. So, yes, I think, um, you know, Nvidia is aware that they\u0027re going to have this, you know, they\u0027re probably expecting to have this. They\u0027re still happy that they can sell to China, so they\u0027re willing to take this, but you just never know what\u0027s coming down the pike. To price that in, I think you just have to be a little conservative in your allocations, maybe not overweight, um some of these names until we have a better feel of what\u0027s coming down the pike.",
          "link": "https://finance.yahoo.com/video/trump-places-25-tariff-ai-145022185.html",
          "publishedAt": "2026-01-15T14:50:22+00:00"
        },
        {
          "id": 8,
          "title": "Semiconductor Optimism Continues to Lift Tech Sector, With US Equity Futures Mostly Higher Pre-Bell",
          "body": null,
          "link": "https://finance.yahoo.com/news/semiconductor-optimism-continues-lift-tech-140343303.html",
          "publishedAt": "2026-01-16T14:03:43+00:00"
        },
        {
          "id": 9,
          "title": "SPS Commerce (SPSC) Fell Following Muted Outlook",
          "body": "Fenimore Asset Management, an investment management company, released its Q4 2025 investor letter. A copy of the same can be downloaded here. The stock market was solid in 2025 but volatile. While investors balanced AI enthusiasm, economic uncertainty, and monetary policy concerns.  The summer rally was driven by AI-related spending and economic resiliency, whereas the fourth quarter saw a more volatile market due to valuation pressures and macro uncertainty. Stocks from the large-cap technology and communication services sectors led the market in the quarter, with the S\u0026P 500 Index rising 2.66%. The firm believes that the trend of AI stocks outpacing high-quality stocks is unsustainable. In Q4 2025, Fenimore Small Cap Strategy returned -4.12%, trailing its benchmark, the Russell 2000 Index’s 2.19% return. The underweight exposure to low-quality stocks drove the underperformance in the quarter. Fenimore Dividend Focus Strategy declined -4.41% in Q4 compared to the Russell Midcap Index’s 0.16% return. Furthermore, Fenimore Value Strategy declined -1.17% in Q4 compared to the Russell Midcap Index’s 0.16% return. Investments in the financial and industrial sectors led to the relative underperformance of the Strategy in the quarter. The firm expects mixed market conditions in 2026 as many AI-related stocks look expensive while high-quality companies are trading at multi-year lows, creating opportunities. In addition, please check the fund’s top five holdings to know its best picks in 2025.          In its fourth-quarter 2025 investor letter, Fenimore Asset Management highlighted stocks such as SPS Commerce, Inc. (NASDAQ:SPSC). SPS Commerce, Inc. (NASDAQ:SPSC) was one of the largest performance detractors in Fenimore Small Cap Strategy. Headquartered in Minneapolis, Minnesota, SPS Commerce, Inc. (NASDAQ:SPSC) offers cloud-based supply chain management solutions. On January 15, 2026, SPS Commerce, Inc. (NASDAQ:SPSC) stock closed at $91.24 per share. One-month return of SPS Commerce, Inc. (NASDAQ:SPSC) was 0.74%, and its shares lost 52.23% of their value over the last 52 weeks. SPS Commerce, Inc. (NASDAQ:SPSC) has a market capitalization of $3.459 billion.   Fenimore Asset Management stated the following regarding SPS Commerce, Inc. (NASDAQ:SPSC) in its fourth quarter 2025 investor letter:    \u0022The biggest drags on performance were Dream Finders Homes (DFH), FirstService Corporation (FSV), and SPS Commerce, Inc. (NASDAQ:SPSC). SPSC reported a more muted near-term business outlook. Whereas there are certainly some environmental issues we think are temporary, we discovered recently that management made a poor acquisition. As a result, an activist has targeted the firm. We continue to believe the business is advantaged and see multiple avenues for value creation.\u0022\n\nIs SPS Commerce Inc. (SPSC) The Best 52-Week Low Stock To Buy Now According to Short Sellers?    SPS Commerce, Inc. (NASDAQ:SPSC) is not on our list of 30 Most Popular Stocks Among Hedge Funds. According to our database, 33 hedge fund portfolios held SPS Commerce, Inc. (NASDAQ:SPSC) at the end of the third quarter, compared to 34 in the previous quarter. The Q3 2025 revenue of SPS Commerce, Inc. (NASDAQ:SPSC) grew 16% year over year to $189.9 million and recurring revenue grew 18%. While we acknowledge the potential of SPS Commerce, Inc. (NASDAQ:SPSC) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you\u0027re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. In another article, we covered SPS Commerce, Inc. (NASDAQ:SPSC) and shared the list of best logistics-tech stocks to buy. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None. This article is originally published at Insider Monkey.",
          "link": "https://finance.yahoo.com/news/sps-commerce-spsc-fell-following-140003335.html",
          "publishedAt": "2026-01-16T14:00:03+00:00"
        },
        {
          "id": 10,
          "title": "Last Year, I Predicted That Alphabet Would Join the $3 Trillion Club. Here\u0027s Why the \u0022Magnificent Seven\u0022 Stock Could Surpass $5 Trillion Before the End of 2027.",
          "body": "Key Points    Less than a year ago, investors were discounting Alphabet\u0027s earnings due to concerns about its long-term growth path.  Now, Alphabet commands a premium valuation thanks to the rapid improvements it has made with its Gemini large language model.  10 stocks we like better than Alphabet ›     On Tuesday, Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) hit a new all-time high as its market capitalization surpassed a $4 trillion. Last year, Microsoft and Apple each briefly joined the $4 trillion club. But at the time of this writing, Alphabet and Nvidia are the only two members.          Alphabet is now up a mind-numbing 136% from its 52-week low. In August, when Alphabet\u0027s market cap was hovering around $2.5 trillion, I predicted that it would surpass $3 trillion before the end of 2027. Here\u0027s why Alphabet exceeded my expectations, and why I now think it has room to run to $5 trillion before the end of next year.     Image source: Alphabet.      Blowing past $3 trillion   My previous Alphabet prediction was heavily based on value rather than growth. In June, Alphabet was the only \u0022Magnificent Seven\u0022 stock that was cheaper than the S\u0026P 500 based on forward earnings estimates. Alphabet also had a lower market cap than Nvidia, Microsoft, Apple, and Amazon, despite being the most profitable S\u0026P 500 company. The market was valuing Alphabet\u0027s earnings as lower quality than those of its big tech peers under the assumption that tools like OpenAI\u0027s ChatGPT were going to revolutionize the way people search for and interact with information, and that Google Search would lose traffic and ad revenues in consequence.          My argument was that Alphabet shouldn\u0027t be treated like a legacy tech giant that\u0027s past its prime because it has a highly diversified asset portfolio that includes not just cash-cow Google Search, but also YouTube, Google Cloud, Android, Google Ads, devices, and \u0022other bets\u0022 like self-driving car subsidiary Waymo. Additionally, Google\u0027s DeepMind-powered Gemini model was achieving success by enhancing Google Search with AI Overviews and gaining traction as a standalone app.   However, my prior prediction for Alphabet to surpass $3 trillion in market cap by 2027 was mainly centered on what Alphabet had already built. It wasn\u0027t factoring in accelerated growth from Gemini.   The Gemini effect    Gemini is the core reason why Alphabet has added $1.5 trillion to its market cap in less than five months and why it could advance further. On Nov. 18, Alphabet launched Gemini 3, an ultra-powerful chatbot that rivals ChatGPT and Claude, and which received widespread favorable reviews. Gemini 3 was a monumental breakthrough for Alphabet because it demonstrated the company\u0027s continued leadership in search. Gemini\u0027s success is partially responsible for the recent sell-off in Microsoft, which is heavily invested in OpenAI and uses its large language models to power Copilot. The contrast between how the two tech giants\u0027 shares have performed over the last three months is obvious.\n\nGOOGL data by YCharts.    But it\u0027s not just Gemini that has investors excited about Alphabet. The company\u0027s custom-made Tensor Processing Units (TPUs) -- which it has been designing in partnership with Broadcom -- offer a solid alternative to the graphics processing units (GPUs) sold by Nvidia and Advanced Micro Devices. Because TPUs are application-specific integrated circuits, they are designed to handle precisely the types of AI workloads they will see. By sacrificing some flexibility, they deliver cost advantages compared to GPUs in data center applications like AI training and inference. Still, GPUs remain the parallel-processing workhorses of AI data centers.      Thus far, Alphabet has been installing its TPUs in its own data centers, but may begin selling them to other hyperscalers as well, which would create an additional AI-fueled revenue stream. The road to $5 trillion With a price-to-earnings ratio of 33.4, Alphabet is no longer cheap. But it\u0027s definitely fairly valued based on the growth potential of Gemini, YouTube, and Google Cloud. Since its valuation is reasonable, it would make sense for Alphabet\u0027s stock price to increase by its earnings growth rate. If Alphabet grows earnings by 10% to 15% annually over the next two years -- and the stock price mirrors that growth rate -- that could push its market cap above $5 trillion.      All told, Alphabet is a solid stock that investors can buy today and build their portfolios around, even while it trades near its all-time high. Should you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $474,847!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,146,655!*      Now, it’s worth noting Stock Advisor’s total average return is 958% — a market-crushing outperformance compared to 196% for the S\u0026P 500. Don\u0027t miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors. See the 10 stocks » *Stock Advisor returns as of January 16, 2026.  Daniel Foelber has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Last Year, I Predicted That Alphabet Would Join the $3 Trillion Club. Here\u0027s Why the \u0022Magnificent Seven\u0022 Stock Could Surpass $5 Trillion Before the End of 2027. was originally published by The Motley Fool",
          "link": "https://finance.yahoo.com/news/last-predicted-alphabet-join-3-135900455.html",
          "publishedAt": "2026-01-16T13:59:00+00:00"
        },
        {
          "id": 11,
          "title": "5 Bargain Stocks That Could Deliver Jaw-Dropping Returns in 2026",
          "body": "Key Points    Being cheaper than the market is a decent measure of whether a stock is a value or not.  Adobe, Amazon, Meta Platforms, PayPal, and The Trade Desk all deserve a closer look.  It\u0027s not uncommon for companies trading at a cheap valuation to repurchase shares.  10 stocks we like better than Amazon ›     Growth investing has been the best way to make a profit over the past few years, but value investing is still a valid investing style, too. There\u0027s even a crossover between the two where you can purchase growth stocks that have fallen out of favor with the market for one reason or another.   All five of these bargains fall into that category, and I think each could be slated for impressive returns in 2026.     Image source: Getty Images.      Amazon   Amazon (NASDAQ: AMZN) may not be what most people consider a bargain stock. However, I think there\u0027s one telling metric that may reveal it as one. In 2025, Amazon dramatically underperformed the market, rising only 5%. However, it posted recent growth highs in many of its operating segments during the third quarter.          This tells me that Amazon as a business is gaining momentum even if the market hasn\u0027t caught on yet. Although Amazon\u0027s stock is up about 7% so far in 2026, I think there is plenty more room to run, and investors should consider scooping this stock up before it reports even better results.   Meta Platforms   I believe that Amazon\u0027s stock is still a bargain at its current levels, and Meta Platforms (NASDAQ: META) joins that list too. The S\u0026P 500 trades for 22.4 times forward earnings right now, while Meta can be bought for 21.1 times forward earnings. The reason for the discount is simple: Wall Street thinks Meta is spending too much on artificial intelligence (AI) data centers.          This has caused the stock to tank, leading to its discount to the market. However, it\u0027s still putting up excellent growth as Meta\u0027s generative AI investments are starting to improve its ad platform. In Q3, Meta\u0027s revenue rose an impressive 26%. If Meta Platforms can keep that growth up, it won\u0027t stay undervalued for long, making it a great stock to buy now.   The Trade Desk    The Trade Desk (NASDAQ: TTD) is also in the ad space although it operates on a different part of the internet. Its buy-side software links ad buyers to the best place on the internet to place their ad, and this business still has a long way to go before becoming fully mature. It\u0027s still delivering strong growth, with revenue rising 18% in the third quarter. However, Wall Street doesn\u0027t think that\u0027s fast enough.\n\nOne key consideration they are forgetting is the lack of political ad spending in 2025 versus 2024. That accounted for a decent chunk of revenue that no longer exists in 2025. This tailwind will disappear in 2026, allowing The Trade Desk to post better growth figures. With the stock trading at 18 times forward earnings, it\u0027s a great buy right now.      Adobe Adobe (NASDAQ: ADBE) is a company that everyone was worried about being disrupted by generative AI -- specifically, its image-generation capabilities. However, Adobe has hung in there just fine and has managed to deliver quarter after quarter of double-digit revenue growth.   ADBE Revenue (Quarterly YoY Growth) Chart    ADBE Revenue (Quarterly YoY Growth) data by YCharts. Despite this, Adobe\u0027s stock is down around 50% from its all-time high. Because of its cheaper price, Adobe\u0027s share repurchases are more effective, which allows for its diluted earnings per share (EPS) to grow at a faster pace. This has driven Adobe\u0027s valuation down dramatically, and the stock now trades for about 14 times forward earnings.      I think Adobe will still be a useful product in the future, and management is doing the right things to maximize its performance while its stock is cheap. PayPal PayPal Holdings (NASDAQ: PYPL) takes the cake for the cheapest stock. It trades for a mere 10 times forward earnings. That\u0027s a very cheap stock, but its growth isn\u0027t the greatest, hovering around the mid-single-digit levels. However, it\u0027s doing something similar to what Adobe is doing and channeling all of its free cash flow into repurchasing shares. This has allowed its diluted EPS growth to grow at a double-digit pace.   PYPL Revenue (Quarterly YoY Growth) Chart    PYPL Revenue (Quarterly YoY Growth) data by YCharts. I think PayPal\u0027s stock is due for a rebound in 2026, and with its cheap stock price, it won\u0027t even need to trade at the same premium as the market to provide a great return for investors. Should you buy stock in Amazon right now? Before you buy stock in Amazon, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $474,847!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,146,655!*      Now, it’s worth noting Stock Advisor’s total average return is 958% — a market-crushing outperformance compared to 196% for the S\u0026P 500. Don\u0027t miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors. See the 10 stocks » *Stock Advisor returns as of January 16, 2026.  Keithen Drury has positions in Adobe, Amazon, Meta Platforms, PayPal, and The Trade Desk. The Motley Fool has positions in and recommends Adobe, Amazon, Meta Platforms, PayPal, and The Trade Desk. The Motley Fool recommends the following options: long January 2027 $42.50 calls on PayPal, long January 2028 $330 calls on Adobe, short January 2028 $340 calls on Adobe, and short March 2026 $65 calls on PayPal. The Motley Fool has a disclosure policy. 5 Bargain Stocks That Could Deliver Jaw-Dropping Returns in 2026 was originally published by The Motley Fool",
          "link": "https://finance.yahoo.com/news/5-bargain-stocks-could-deliver-135000336.html",
          "publishedAt": "2026-01-16T13:50:00+00:00"
        },
        {
          "id": 12,
          "title": "What Does Red Violet, Inc.\u0027s (NASDAQ:RDVT) Share Price Indicate?",
          "body": "While Red Violet, Inc. (NASDAQ:RDVT) might not have the largest market cap around , it saw significant share price movement during recent months on the NASDAQCM, rising to highs of US$59.42 and falling to the lows of US$50.82. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether Red Violet\u0027s current trading price of US$51.28 reflective of the actual value of the small-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at Red Violet’s outlook and value based on the most recent financial data to see if there are any catalysts for a price change.          We\u0027ve found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.   Is Red Violet Still Cheap?   According to our price multiple model, where we compare the company\u0027s price-to-earnings ratio to the industry average, the stock currently looks expensive. We’ve used the price-to-earnings ratio in this instance because there’s not enough visibility to forecast its cash flows. The stock’s ratio of 64.49x is currently well-above the industry average of 32.35x, meaning that it is trading at a more expensive price relative to its peers. But, is there another opportunity to buy low in the future? Given that Red Violet’s share is fairly volatile (i.e. its price movements are magnified relative to the rest of the market) this could mean the price can sink lower, giving us another chance to buy in the future. This is based on its high beta, which is a good indicator for share price volatility.           View our latest analysis for Red Violet    What does the future of Red Violet look like?     NasdaqCM:RDVT Earnings and Revenue Growth January 16th 2026      Future outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. With profit expected to grow by a double-digit 12% over the next couple of years, the outlook is positive for Red Violet. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.          What This Means For You    Are you a shareholder? RDVT’s optimistic future growth appears to have been factored into the current share price, with shares trading above industry price multiples. At this current price, shareholders may be asking a different question – should I sell? If you believe RDVT should trade below its current price, selling high and buying it back up again when its price falls towards the industry PE ratio can be profitable. But before you make this decision, take a look at whether its fundamentals have changed.\n\nAre you a potential investor? If you’ve been keeping an eye on RDVT for a while, now may not be the best time to enter into the stock. The price has surpassed its industry peers, which means it is likely that there is no more upside from mispricing. However, the optimistic prospect is encouraging for RDVT, which means it’s worth diving deeper into other factors in order to take advantage of the next price drop.      So while earnings quality is important, it\u0027s equally important to consider the risks facing Red Violet at this point in time. You\u0027d be interested to know, that we found 1 warning sign for Red Violet and you\u0027ll want to know about it. If you are no longer interested in Red Violet, you can use our free platform to see our list of over 50 other stocks with a high growth potential. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
          "link": "https://finance.yahoo.com/news/does-red-violet-inc-nasdaq-134424364.html",
          "publishedAt": "2026-01-16T13:44:24+00:00"
        },
        {
          "id": 13,
          "title": "ProStar To Raise US$500,000 Via Private Placement Of Secured Convertible Debentures",
          "body": null,
          "link": "https://finance.yahoo.com/news/prostar-raise-us-500-000-134233796.html",
          "publishedAt": "2026-01-16T13:42:33+00:00"
        },
        {
          "id": 14,
          "title": "These Stocks Are Today’s Movers: Micron, Sandisk, AST SpaceMobile, ImmunityBio, HP Inc., Novo Nordisk, and More",
          "body": null,
          "link": "https://www.barrons.com/articles/stock-movers-45c8219d?siteid=yhoof2\u0026yptr=yahoo",
          "publishedAt": "2026-01-16T13:42:00+00:00"
        },
        {
          "id": 15,
          "title": "Nvidia Stock Only Seems to Be Losing Its AI Halo. This Analyst Sees a Buying Opportunity.",
          "body": null,
          "link": "https://www.barrons.com/articles/nvidia-stock-price-analyst-buy-ai-3a0dfa05?siteid=yhoof2\u0026yptr=yahoo",
          "publishedAt": "2026-01-16T13:40:00+00:00"
        },
        {
          "id": 16,
          "title": "Are you concerned about losing your job this year? How readers voted",
          "body": "Continued signs of weakness in the UK labour market has created some uncertainty over the outlook for jobs for the year ahead.   Permanent staff appointments in December fell at their quickest rate since August, according to the latest UK Report on Jobs survey by KPMG and the Recruitment \u0026 Employment Confederation (REC), published Monday.          The report said that candidate numbers continued to rise at a \u0022substantial pace\u0022 last month, with redundancies cited as the main driver of growing supply.   Jon Holt, group CEO and UK senior partner KPMG, said: \u0022The jobs market at the end of 2025 was still signalling caution.   \u0022After a long stretch of rising cost pressures and higher global economic uncertainty, many firms continue to pause hiring and are flexing where they can by using temporary staff.\u0022   Holt said that \u0022this restraint is likely to remain in the near term\u0022.   Read more: UK economy grew by more than expected in November despite budget uncertainty   While the latest UK economic growth data, released on Thursday, came in stronger than expected, there\u0027s still some caution looking ahead. The UK\u0027s gross domestic product (GDP) is estimated to have grown by 0.3% in November, according to Office for National Statistics (ONS) data. This was better than forecasts for 0.1% growth and followed an unrevised fall of 0.1% in October.          Rob Morgan, chief investment analyst at Charles Stanley, said on the back of this data the UK economy looks set to complete the second half in positive territory, with just December\u0027s GDP data left to confirm.   \u0022For 2026, expect more of the same: a mildly positive first half, then renewed weakness later,\u0022 he said. \u0022Deferred spending and investment may provide an early lift, but without gains in productivity or labour participation – and with the tax burden still weighing on sentiment – the economy is likely to stay stuck in low gear.\u0022   He said that weak economic growth \u0022will keep pressure on a febrile jobs market\u0022.   The most recent UK labour market data, released by the ONS last month, showed that the rate of unemployment rose to 5.1% in the three months to October. Meanwhile, annual growth in average earnings, excluding bonuses, came in at 4.6% for this period, which was down from 4.7% for the previous three months.   Earlier this week, we asked readers if they were worried about losing their job this year. We received 81 votes, with 47% saying that they were concerned, while 41% were not and 12% were undecided on the matter.     Are you concerned about losing your job this year?      Read more:    UK rents expected to rise 2% in 2026 amid \u0027chronic\u0027 housing shortage  Further interest rate cuts backed by Bank of England policymaker  Most popular stocks and funds investors bought in 2025     Download the Yahoo Finance app, available for Apple and Android.",
          "link": "https://finance.yahoo.com/news/job-losses-unemployment-uk-poll-results-133703725.html",
          "publishedAt": "2026-01-16T13:37:03+00:00"
        },
        {
          "id": 17,
          "title": "Hollywood billionaire’s battle royale over Warner Bros comes to Britain",
          "body": "David Ellison, pictured at the Golden Globes, wants regulators to obstruct Netflix’s rival bid for Warner Bros - Alberto Rodriguez/2026GG/Penske Media via Getty Images      The billionaire boss of Paramount has held talks with the Culture Secretary to lobby against Netflix’s $83bn (£62bn) takeover of Warner Bros.   David Ellison, son of Oracle founder Larry Ellison, travelled to London on Thursday for a meeting with Lisa Nandy as part of a wider charm offensive designed to defeat Netflix in the escalating takeover battle.          Paramount is trying to convince shareholders to back its $30-per-share takeover offer and encourage regulators to obstruct Netflix’s rival bid, which was accepted by Warner Bros late last year.   Warner Bros has repeatedly rebuffed Paramount’s overtures, insisting that the $83bn deal agreed with Netflix last month remains superior.   Paramount’s campaign is centred on arguments that a merger between Netflix and Warner Bros would pose significant competition concerns owing to the combined company’s dominance in the streaming market.   Warner Bros owns Discovery\u002B, which is home to TNT Sports, and HBO Max, a major US streaming service that is scheduled to launch in the UK in March.   Executives are also emphasising the impact of the deal on cinemas amid concerns that Netflix could reduce the number of films distributed for theatrical release.   In addition to the meeting with Ms Nandy, Paramount has met with officials at the Competition and Markets Authority and regulator Ofcom.     Lisa Nandy met David Ellison on Thursday - Wiktor Szymanowicz/Future Publishing via Getty Images      Mr Ellison also met cinema executives who are fearful that Netflix will cut Warner Bros’ theatrical investments.   A source close to Paramount said the meetings were intended to build relationships after the Ellison family took control of the US studio in an $8bn deal last year.   Paramount owns Channel 5, while it has also made a number of major films in the UK, including the latest instalment in the Mission: Impossible franchise.          The planned takeover of Warner Bros will mark a major reshaping of Hollywood as traditional studios seek to build scale to compete in the cut-throat streaming era.   Any deal will also have significant implications in the UK, where Warner Bros employs around 4,000 people. The company has made a raft of blockbusters in its Leavesden studios near Watford in recent years, including Barbie and Wonka.     Timothy Chalamet and Hugh Grant starred in Warner Bros’ hit film Wonka in 2023 - Unique Nicole/FilmMagic      Paramount’s PR push   Netflix has played down competition concerns and insisted it is committed to releasing films in cinemas, though it has acknowledged that the regulatory review process could take up to 18 months.    Paramount would itself face regulatory scrutiny over its plans to merge two of Hollywood’s major studios, though insiders said they were confident the proposed deal would clear any reviews.\n\nMr Ellison and Paramount executives’ meetings form part of a broader charm offensive across Europe as the company seeks to shore up support from regulators in Brussels. Senior executives also recently met Emmanuel Macron, the French president, Bloomberg reported. The studio has tapped City PR firm Brunswick to help in its discussions, while US law firms Cravath, Swaine \u0026 Moore and Latham \u0026 Watkins are advising on the deal.      Paramount’s lead financial advisers are Centerview Partners and bankers at RedBird Capital, the US private equity firm led by Gerry Cardinale, which is also the company’s second-largest shareholder. Mr Cardinale, who sits on Paramount’s board, is also thought to be working with Greenlight Group, a regulatory advisory launched late last year by Ali Nikpay, Daniel Gieve and Adam Atashzai. Mr Gieve is a former chief executive of the Government’s Office for Investment. Mr Atashzai also briefly held an advisory role in No10 under the Conservatives, while Mr Nikpay is a former partner at law firm Gibson Dunn. Paramount ramped up its campaign this week by suing Warner Bros in an effort to secure “basic information” that it said had not been shared with investors. It has also outlined plans to appoint directors to the Warner Bros board and fight a proxy battle against the Netflix deal. However, the company was dealt a setback on Thursday when a Delaware judge rejected a request to fast-track its lawsuit. Paramount has given Warner Bros shareholders until January 21 to accept its bid, though this deadline could be extended. Paramount and the Department for Digital, Culture, Media and Sport declined to comment.",
          "link": "https://finance.yahoo.com/news/hollywood-billionaire-battle-royale-over-133255054.html",
          "publishedAt": "2026-01-16T13:32:55+00:00"
        },
        {
          "id": 18,
          "title": "Will the FCC Approve NextNav’s (NN) Plan?",
          "body": "Laughing Water Capital, an investment management company, released its fourth-quarter 2025 investor letter. In the quarter, Laughing Water Capital returned ~6.8%, bringing the full-year returns to ~3.9% net of fees and expenses. In comparison, the SP500TR and R2000 returned approximately 2.7% and 2.2%, respectively, in the quarter, and finished the year up by 17.9% and 12.8%, respectively. A copy of the letter can be downloaded here. The Fund outperformed the indexes last year, but it has lagged behind them in the current year. However, what really matters is the cumulative returns over the long run, as volatility tends to smooth out over time. The Portfolio is well-positioned in this regard, delivering strong results on a cumulative basis since inception and returned about 400%, vs ~332% for the SP500TR and ~175% for our most relevant benchmark, the R2000. In addition, you can check the Strategy’s top five holdings to know its best picks in 2025.          In its fourth-quarter 2025 investor letter, Laughing Water Capital highlighted stocks such as NextNav Inc. (NASDAQ:NN). NextNav Inc. (NASDAQ:NN) provides next-generation positioning, navigation, and timing (PNT) solutions.  On January 15, 2026, NextNav Inc. (NASDAQ:NN) stock closed at $14.93 per share. One-month return of NextNav Inc. (NASDAQ:NN) was -11.08%, and its shares gained 14.93% of their value over the last 52 weeks. NextNav Inc. (NASDAQ:NN) has a market capitalization of $2.01 billion.   Laughing Water Capital stated the following regarding NextNav Inc. (NASDAQ:NN) in its fourth quarter 2025 investor letter:    \u0022NextNav Inc. (NASDAQ:NN): NextNav is our wireless spectrum / terrestrial backup to GPS investment. Shares were more or less flat for the year, which of course did not help our performance. The factors here are completely unattractive, and completely irrelevant. The only things that will matter for the success of the investment are getting FCC approval for NextNav’s plan, and what the re-purposed spectrum would be worth.\n\nThe Most Advanced Place in the World in 5G Technology    NextNav Inc. (NASDAQ:NN) is not on our list of 30 Most Popular Stocks Among Hedge Funds. According to our database, 29 hedge fund portfolios held NextNav Inc. (NASDAQ:NN) at the end of the third quarter, compared to 33 in the previous quarter. While we acknowledge the potential of NextNav Inc. (NASDAQ:NN) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you\u0027re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.      In another article, we covered NextNav Inc. (NASDAQ:NN) and shared the list of small-cap tech stocks on Wall Street’s radar. In its Q3 2025, Laughing Water Capital noted that NextNav Inc. (NASDAQ:NN) fell 20% due to fears of a government shutdown and, concerns of selling shares from the estate that received them in the spectrum license transaction. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None. This article is originally published at Insider Monkey.",
          "link": "https://finance.yahoo.com/news/fcc-approve-nextnav-nn-plan-133209123.html",
          "publishedAt": "2026-01-16T13:32:09+00:00"
        },
        {
          "id": 19,
          "title": "Stock Market Today: Dow Wavers Near Record Highs; Nvidia Regains Key Level (Live Coverage)",
          "body": null,
          "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-record-highs-nvidia-nvda-stock/?src=A00220\u0026yptr=yahoo",
          "publishedAt": "2026-01-16T13:31:41+00:00"
        },
        {
          "id": 20,
          "title": "Laughing Water Capital’s Updates on Liquidia Corp (LQDA)",
          "body": "Laughing Water Capital, an investment management company, released its fourth-quarter 2025 investor letter. In the quarter, Laughing Water Capital returned ~6.8%, bringing the full-year returns to ~3.9% net of fees and expenses. In comparison, the SP500TR and R2000 returned approximately 2.7% and 2.2%, respectively, in the quarter, and finished the year up by 17.9% and 12.8%, respectively. A copy of the letter can be downloaded here. The Fund outperformed the indexes last year, but it has lagged behind them in the current year. However, what really matters is the cumulative returns over the long run, as volatility tends to smooth out over time. The Portfolio is well-positioned in this regard, delivering strong results on a cumulative basis since inception and returned about 400%, vs ~332% for the SP500TR and ~175% for our most relevant benchmark, the R2000. In addition, you can check the Strategy’s top five holdings to know its best picks in 2025.          In its fourth-quarter 2025 investor letter, Laughing Water Capital highlighted stocks such as Liquidia Corporation (NASDAQ:LQDA). Liquidia Corporation (NASDAQ:LQDA) is a biopharmaceutical company that develops, manufactures, and commercializes various products for unmet patient needs in the United States. The one-month return for Liquidia Corporation (NASDAQ:LQDA) was 12.34%, and its shares gained 200.93% over the last 52 weeks. On January 15, 2026, Liquidia Corporation (NASDAQ:LQDA) stock closed at $38.79 per share, with a market capitalization of $3.375 billion.   Laughing Water Capital stated the following regarding Liquidia Corporation (NASDAQ:LQDA) in its fourth quarter 2025 investor letter:    \u0022Liquidia Corporation (NASDAQ:LQDA) – Liquidia was first introduced anonymously in the YE’24 letter to LPs. At the time, the company was a pre-approval biopharmaceutical company that was mired in patent lawsuits filed by an incumbent (United Therapeutics - UTHR) that was seeking to defend their market position versus an upstart that seems to have a superior product. Since that time, Liquidia’s drug – Yutrepia – has been approved for treatment of pulmonary arterial hypertension (PAH) and pulmonary hypertension associated with interstitial lung disease (PH-ILD). Early sales of Yutrepia have crushed expectations as patients – and prescribers - seem to prefer Yutrepia vs. the incumbent due to superior delivery and tolerability. Between appreciation and adding to the position as the company reached important milestones, LQDA has grown into a top position.\n\nLiquidia Corporation (NASDAQ:LQDA) is not on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 42 hedge fund portfolios held Liquidia Corporation (NASDAQ:LQDA) at the end of the third quarter, which was 43 in the previous quarter. While we acknowledge the potential of Liquidia Corporation (NASDAQ:LQDA) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you\u0027re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.      In another article, we covered Liquidia Corporation (NASDAQ:LQDA) and shared Arquitos Capital Management\u0027s views on the company in the previous quarter. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None. This article is originally published at Insider Monkey.",
          "link": "https://finance.yahoo.com/news/laughing-water-capital-updates-liquidia-132906062.html",
          "publishedAt": "2026-01-16T13:29:06+00:00"
        }
      ]
    }
  }
}